       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.

      *********************************************************************
      *AREA DE REMARKS
      *AUTHOR = Mauricio Gallo Fausto Jr
      *********************************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO ALURA'.
           STOP RUN.
